
{"objects": [{"description": "<p>This person will manage financial organization, budgeting, control, forecasting, systems and process implementations. A successful Controller candidate will manage accounting, reporting, finance, budgeting and modeling functions, including billings, A/R, A/P and Payroll. Reports directly to the Vice President of Operations.</p>\n<p>&nbsp;<strong>Duties and Responsibilities:</strong></p>\n<ul>\n<li>Ensure that company financial records and reports are maintained in compliance with company policies and US GAAP (accrual basis). Responsible for preparing monthly/quarterly draft financial statements, forecasts, account reconciliations and other documents to ensure this compliance.</li>\n<li>Calculate and issue financial and operating metrics.</li>\n<li>Implement policies and procedures (internal controls) to provide reasonable assurance that the company assets are protected.</li>\n<li>Ensure only valid expenses with proper management authorization are paid and that accounts payable are paid in a timely manner</li>\n<li>Own the chart of accounts and maintain an orderly accounting filing system</li>\n<li>Ensure that (i) contract terms evolve and are administered effectively in accordance with company policy (ii) credit risk and other negotiable terms are balanced with business objectives and (iii) progress toward targets are clearly communicated.</li>\n<li>Responsible for proper timing and application of revenue recognition rules. Involves significant interaction with Sales and Customer Service groups.</li>\n<li>Ensure the completion of Federal and State tax reporting requirements (including income, property, sales and use, payroll and other local taxes), insurance reports and other reports that may be required by government entities.</li>\n<li>Coordinate work relating to external audits in the periodic review of the company financial records.</li>\n<li>Responsible for the implementation of agreed upon recommendations, related to areas of responsibility, resulting from the audit findings.</li>\n<li>Startup mentality! This is a fast-growing startup environment and the candidate must have a willingness to pitch-in when asked to support other areas.</li>\n</ul>\n<p><strong>Degree/Licenses Required:</strong></p>\n<ul>\n<li>4-year undergraduate degree (preferably in Accounting)</li>\n<li>CPA certification</li>\n</ul>\n<p><strong>Prior Experience:</strong></p>\n<ul>\n<li>Minimum 5 years of accounting experience, with top-tier public accounting being a plus.</li>\n<li>Demonstrated ability to plan and close books and prepare financial statements monthly</li>\n<li>Experience analyzing business performance and developing financial plans within a startup environment desirable.</li>\n<li>Understanding of US GAAP, internal controls and financial reporting required.</li>\n</ul>\n<p><strong>ABOUT SPRING:</strong></p>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience.&nbsp;Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Celine,&nbsp;and Marc Jacobs, just to name a few.&nbsp;Now we&rsquo;re working together to re-imagine&nbsp;mobile&nbsp;commerce.</p>\n<p>Our office is a unique hybrid of engineers and&nbsp;our brand team.&nbsp;Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking,&nbsp;guzzling cold brew and/or having late night dinners in our awesome office&nbsp;in the heart of SoHo.</p>\n<p>We provide&nbsp;our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pup, Gizmo.</p>\n<p>Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on a&nbsp;product that'll impact millions.&nbsp;</p>\n<p>&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": true, "title": "Financial Controller", "allows_remote": false, "created_on": 1420324878, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1426457230, "application_email": "SPRING-SPRI0293@applications.recruiterbox.com", "id": "mp0hmno", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0ert/"}, {"description": "<p>We're looking for developers who love to get stuff done, but also understand code quality, large scale, and the tradeoffs that come with each choice they make.&nbsp;</p>\n<p>Things like good coding style, a continuous build, tests are part of the process early on. We're very passionate about great engineering and about striking the right balance between speed, maintainability and scalability.</p>\n<p>Our current stack is Go, PostgreSQL, AngularJS and iOS and we picked them thoughtfully because they are the right tools that will help us move fast and build high quality products.</p>\n<p>We&rsquo;re a small company, and we&rsquo;re very transparent, so you&rsquo;ll see everything that goes into building Spring: code, marketing, sales, design, customer support, brand curation, etc., the kind of stuff you would never learn somewhere bigger or more corporate. You&rsquo;ll also get one on one time with our leadership, who make a point of making sure each employee&rsquo;s work is seen.</p>\n<h3>Responsibilities:&nbsp;</h3>\n<ul>\n<li>Take ownership over vertical parts of our products, spanning from the consumer all the way to the backend.&nbsp;</li>\n<li>Evaluate various APIs, tools, frameworks, and make informed, educated decisions about using them or developing something in house.&nbsp;</li>\n<li>Ship great code and take responsibility when things break.&nbsp;</li>\n</ul>\n<h3>Requirements:&nbsp;</h3>\n<ul>\n<li>BS or MS in&nbsp;engineering, CS, Physics, Math, or related discipline with a graduation date between December 2014 and June 2015</li>\n<li>Feel comfortable switching languages and learning new ones. Go is a young language and we don't expect you to be proficient in it, but you will have to pick it up.</li>\n<li>Ability to go from ObjectiveC to sysadmin at a moment's notice - all to get a project shipped</li>\n<li>Past internship experience at a tech company highly preferred.&nbsp;</li>\n</ul>\n<h3>About Spring</h3>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience. Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman and Marc Jacobs, just to name a few. Now we&rsquo;re working together to re-imagine mobile commerce.</p>\n<p>Our office is a unique hybrid of engineers and our brand team. Though our backgrounds in development and fashion may seem an odd pairing, we&rsquo;re actually a tight knit bunch! You&rsquo;ll find us cranking, guzzling cold brew and/or having late night dinners in our awesome office in the heart of SoHo.</p>\n<p>We provide our employees with a happy, productive workplace, and we&rsquo;re constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pup, Gizmo.</p>\n<p>&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": true, "title": "Software Engineer, Recent Grad", "allows_remote": false, "created_on": 1418776034, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1429210112, "application_email": "SPRING-SPRI0384@applications.recruiterbox.com", "id": "mp0hmwf", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0y5f/"}, {"description": "<p>The Data Entry position is responsible for collecting product information and images for hundreds of products from different brands, and inputting this data into spreadsheets for upload into a technology back-end. Accuracy and efficiency are critical, and so the ideal candidate will have displayed strong attention to detail in previous roles. Interest in technology, fashion, or design a plus. This role is at an early-stage start-up based in Soho in New York City.</p>\n<p>This is an hourly position, and the project is expected to last 3 weeks. Hours are 9:30 - 5:30pm, Monday - Friday.</p>\n<p>&nbsp;</p>\n<p><strong style=\"font-size: 18px;\">Our Team</strong></p>\n<p>Our office is a hybrid of our engineers and the brand team, which is made up of some of the best people in fashion and ecommerce. We're a tight knit bunch, just moved into an awesome office&nbsp;in SoHo.</p>\n<p>We take our work and our culture seriously. Our goal is to provide all our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We play boardgames, have a kickball team, are known to enjoy a good karaoke outing from time to time, and have two puppies, Fred &amp; Gizmo who run around and keep us on our toes. We offer full benefits, unlimited vacation time, a competitive salary and the opportunity to work on a really amazing product with truly smart people.&nbsp;</p>", "tags": [], "position_type": null, "is_archived": true, "title": "Data Entry Temp Position", "allows_remote": null, "created_on": 1407265232, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1429210126, "application_email": "SPRING-SPRI0487@applications.recruiterbox.com", "id": "mp05dj", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0nww/"}, {"description": "<p>The Technical Service Lead will be responsible for the investigation and resolution of all operational issues, and provide technical assistance and training to Spring&rsquo;s community of Brands. The Service Lead will be responsible for fixing basic technical issues and for triaging more complex requests to the Engineering team.&nbsp; They will work closely with the Product and Engineering teams to prioritize the technical queue and future feature development.&nbsp; The Technical Service Lead will also support the Brand Strategy, Concierge, and Brand Service teams as the supply side of Spring&rsquo;s marketplace grows.&nbsp; In this position, a successful candidate will gain a deep understanding of Spring&rsquo;s brand and consumer products as well as our cross-functional operations.&nbsp; They will also regularly interact with our Brand partners, assisting them as they navigate our Brand Portal and ecommerce integrations.</p>\n<p>The Technical Service Lead position is an amazing opportunity for creative, solutions-oriented individuals with an interest in gaining deep product and technical knowledge to join our fast-growing start-up, named as one of Apple&rsquo;s top 25 apps of 2014.&nbsp;</p>\n<p><strong>KEY RESPONSIBILITIES:</strong></p>\n<ul>\n<li>Own technical problem-solving, triaging, and troubleshooting for the Brand product for the Operations team</li>\n<li>Provide technical support and training to Spring Brands and partners</li>\n<li>Prioritize technical fixes and feature requests with the Product and Engineering team; fix basic brand-related issues in real-time</li>\n<li>Work with our Concierge, brand management, operations, engineering, and product teams improve internal processes, and drive the brand and customer experience</li>\n<li>Proactively&nbsp;identify and execute on opportunities for enhancing both the brand and the consumer experience</li>\n<li>Write specs for new product features, and tackle small software development projects</li>\n</ul>\n<p><strong>BASIC REQUIREMENTS:</strong></p>\n<ul>\n<li>Four-year college degree</li>\n<li>Minimum 2 years of product management, management consulting, or project management experience</li>\n<li>Ruthless attention to detail and comfort with large datasets. Spreadsheet skills are a must; experience with SQL is a plus.</li>\n<li>Passion for product and technology</li>\n<li>Exceptional oral and written communication skills with ability to convey information clearly and effectively.&nbsp; This role is externally-facing</li>\n<li>Demonstrated problem-solving ability and experience learning new systems, platforms, and/or processes</li>\n<li>Strong organizational skills</li>\n<li>Work well in a fast-paced team setting - \"no job too small\"</li>\n<li>Must be creative, and have a high level of initiative and outstanding work ethic</li>\n<li>Software development experience a plus</li>\n</ul>\n<p><strong>ABOUT SPRING:</strong></p>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience.&nbsp;Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Celine,&nbsp;and Marc Jacobs, just to name a few.&nbsp;Now we&rsquo;re working together to re-imagine&nbsp;mobile&nbsp;commerce.</p>\n<p>Our office is a unique hybrid of engineers and&nbsp;our brand team.&nbsp;Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking,&nbsp;guzzling cold brew and/or having late night dinners in our awesome office&nbsp;in the heart of SoHo.</p>\n<p>We provide&nbsp;our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pup, Gizmo.</p>\n<p>Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on a&nbsp;product that'll impact millions.&nbsp;</p>\n<p>&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": true, "title": "Technical Service Lead", "allows_remote": false, "created_on": 1420498348, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1435771075, "application_email": "SPRING-SPRI0430@applications.recruiterbox.com", "id": "mp0hmgo", "is_private": true, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0etf/"}, {"description": null, "tags": [], "position_type": null, "is_archived": false, "title": "Visual Designer", "allows_remote": null, "created_on": 1424302547, "location": {"city": null, "state": null, "country": null}, "team": "", "modified_on": 1424306229, "application_email": "SPRING-SPRI0163@applications.recruiterbox.com", "id": "mp0h3bx", "is_private": null, "hosted_url": null}, {"description": "<p class=\"p1\">Join the Spring team as a Fashion Merchandising Intern.&nbsp; Merchandising interns are responsible for assortment management, visual content creation, brand shop merchandising, and feed promotion of apparel, accessory, and shoe brands on the Spring platform.&nbsp; This highly-creative position will give you the opportunity to independently manage the Spring experience for a wide range of brands, become a mobile and ecommerce merchandising expert, and collaborate with multiple teams across Spring, including marketing, brand curation, brand management, and product management.</p>\n<p class=\"p1\">The Fashion Merchandising internship is an amazing opportunity for a fashion-obsessed, creative, solutions-oriented individual to join our exciting, fast-growing start-up. &nbsp;</p>\n<p class=\"p1\">Internship can be paid or for credit, expected to be 10-20 hrs/wk.</p>\n<p class=\"p2\">&nbsp;</p>\n<p class=\"p1\"><strong>RESPONSIBILITIES may include</strong></p>\n<ul class=\"ul1\">\n<li class=\"li1\">Manage Brand Shops with broad assortment for 20+ brands</li>\n<li class=\"li1\">Merchandise Shops based on product categories, fashion and sales trends, marketing stories, and content</li>\n<li class=\"li1\">Develop in-house content (photography, product descriptions, captions, lookbooks, etc.) to enhance visual merchandising of Brand Shops</li>\n<li class=\"li1\">Promote brand posts into Spring feed&nbsp;</li>\n<li class=\"li1\">Coordinate with Marketing for promotions and consumer stories</li>\n<li class=\"li1\">Occasionally, will be asked and expected to perform various, miscellaneous, and non-standard duties as required. Such duties are diversified in nature and may be changed from time to time to suit the needs of the company.</li>\n</ul>\n<p class=\"p2\">&nbsp;</p>\n<p class=\"p1\"><strong>YOU ARE:&nbsp;</strong></p>\n<ul class=\"ul1\">\n<li class=\"li1\">Creative, energetic, a roll-up-your-sleeves get sh*t done type, and ready to think outside the (light)box.</li>\n<li class=\"li1\">Very well-versed in, and passionate about, fashion</li>\n<li class=\"li1\">Extremely well-organized</li>\n<li class=\"li1\">An aspiring merchandiser, retail manager, or content creator</li>\n<li class=\"li1\">Great with a camera&nbsp;</li>\n</ul>\n<p class=\"p1\"><strong>BASIC REQUIREMENTS:</strong></p>\n<ul class=\"ul1\">\n<li class=\"li1\">Four-year college degree</li>\n<li class=\"li1\">Demonstrated product/merchandise styling capabilities (general knowledge of fashion brands)</li>\n<li class=\"li1\">Must be creative, and have a high level of initiative and outstanding work ethic</li>\n<li class=\"li1\">Exceptional oral and written communication skills with ability to convey information clearly and effectively</li>\n<li class=\"li1\">Experience with Visual Display, Visual Merchandising, Textile Design, or Merchandising</li>\n</ul>\n<p class=\"p1\"><strong>PREFERRED:</strong></p>\n<ul class=\"ul1\">\n<li class=\"li1\">Photography and photo-editing (Photoshop, Illustrator and/or InDesign, as well as phone app editing tools like Afterlight and Snapseed)</li>\n</ul>\n<p class=\"p2\">&nbsp;</p>\n<p class=\"p1\"><strong>About Spring:</strong></p>\n<p class=\"p1\">Spring was founded with one simple vision: to create the best mobile shopping experience. Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google, Amazon, and Medium and brands such as DVF, Celine, and Marc Jacobs, just to name a few. Now we&rsquo;re working together to re-imagine mobile commerce.</p>\n<p class=\"p1\">Our office is a unique hybrid of engineers and our brand team. Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking, guzzling cold brew and/or having late night dinners in our awesome office in the heart of SoHo.</p>\n<p class=\"p1\">We provide our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pups, Gizmo &amp; Jin.</p>", "tags": [], "position_type": "part_time", "is_archived": false, "title": "Fashion Merchandising Intern", "allows_remote": false, "created_on": 1439919050, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1439920301, "application_email": "SPRING-SPRI0966@applications.recruiterbox.com", "id": "mp0h4ax", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0h7kv/"}, {"description": "<p>The Beauty Brand Curator represents Spring in the brand community by leveraging strong contacts, researching, discovering, and on-boarding a wide range of beauty, wellness and apothecary brands.&nbsp;</p>\n<p>This is a unique opportunity for someone with a pr/marketing, sales or editorial &nbsp;background to take the leap into the tech world and make a genuine impact on how beauty lives on mobile. You will work closely with the Chief Brand Office and the rest of the Curation team as they curate the Spring platform for best in class brands across high/low price points, and niche/emerging as well as mass/established brands that speak to the way today&rsquo;s modern consumer shops.</p>\n<h3 style=\"font-size: 24px;\">&nbsp;</h3>\n<h3 style=\"font-size: 24px;\"><strong>YOU</strong>:</h3>\n<ul>\n<li>\n<p>Love Spring! You're an early adopter who's passionate about the industry and our app!</p>\n</li>\n<li>\n<p>Are active in social media, you understand the importance of great content</p>\n</li>\n<li>\n<p>Are ready to right dive in, entrepreneurial and have a \"no job too small\" attitude</p>\n</li>\n<li>\n<p>Are comfortable representing Spring and the Spring brand as the Brand Curation team are the front line ambassadors</p>\n</li>\n<li>\n<p>Have a strong sense of the Beauty industry. You know brands, the cadence of the Beauty calendar and key influencers, and you have a sensitivity to adjacencies, seasonality, price points etc</p>\n</li>\n<li>\n<p>Can be a cheerleader for a brand about which you're passionate - but also not overly personalize and can see opportunities beyond your own preferences</p>\n</li>\n<li>\n<p>Speak Beauty. You know the difference between a L'Oreal &amp; Linda Rodin, Organic and Botanical</p>\n</li>\n<li>\n<p>Can partner with our Marketing &amp; Brand Manager teams to help craft unique opportunities for brands to optimize their performances on Spring</p>\n</li>\n<li>\n<p>Are interested and able to flex across Beauty &amp; Grooming&nbsp;</p>\n</li>\n</ul>\n<h3 style=\"font-size: 24px;\"><span style=\"font-size: 13px;\">&nbsp;</span></h3>\n<h3 style=\"font-size: 24px;\"><strong>DESIRED SKILLS AND EXPERIENCE:</strong></h3>\n<p>&nbsp;</p>\n<ul>\n<li>\n<p>Possess 5+ &nbsp;years experience either in sales, beauty buying office, editorial/media, branding, marketing, or public relations agency or department focused on Beauty</p>\n</li>\n<li>\n<p>Have excellent communication and relationship skills. You have a proven ability to network across functions, be a team player, and work towards key objectives as a unified whole</p>\n</li>\n<li>\n<p>Are passionate about finding, championing and supporting great Brands</p>\n</li>\n<li>\n<p>Are creative and have a high level of initiative and self motivation</p>\n</li>\n<li>A strong comfort level with technology is a big bonus</li>\n<li></li>\n</ul>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Beauty Curator", "allows_remote": false, "created_on": 1428774552, "location": {"city": "584 Broadway #908", "state": null, "country": null}, "team": "", "modified_on": 1437679781, "application_email": "SPRING-SPRI0457@applications.recruiterbox.com", "id": "mp0hvxx", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0hfws/"}, {"description": "<p>Brand Managers&nbsp;represent Spring&nbsp;by supporting, encouraging and strategizing with our Brand partners, enabling brands to optimize their efforts and performance on Spring. Brand Managers provide platform-wide and personalized insights and offer solutions and advice, while providing a seamless and excellent experience for our brands.</p>\n<p>&nbsp;</p>\n<h3><strong>KEY RESPONSIBILITIES:</strong></h3>\n<ul>\n<li>Onboard and coach our brand partners on work processes, navigating the brand portal and new opportunities to enable seamless integration and productive partnership</li>\n<li>Drive strategic and marketing support for brands to grow business on Spring and across retail channels</li>\n<li>Support brands in creating, curating, scheduling and posting content, crafting emails and newsletters and maximizing social media</li>\n<li>Partner with Spring's&nbsp;Marketing team to create specific brand strategies and action plans to optimize targeting, discovery and conversion - as well as unique opportunities to strengthen Brand's performance on the platform</li>\n<li>Develop customized analytics and insights. Review results, assess performance and deliver recommendations&nbsp;on areas of improvement</li>\n<li>Work with brands as the single point of contact who can address any issue with the appropriate Spring's department in a timely manner</li>\n<li>Proactively&nbsp;identify and execute on opportunities for enhancing/improving both the Brand and the consumer experience</li>\n</ul>\n<p>&nbsp;</p>\n<h3><strong>DESIRED SKILLS AND EXPERIENCE:</strong></h3>\n<ul>\n<li>4+ years at an early-stage, growth start-up, sales, B-to-B account management, marketing, business development, or strategy</li>\n<li>Amazing relationship skills and a proven ability to network across functions.</li>\n<li>Deep understanding of social media.</li>\n<li>Positive and mature working style.</li>\n<li>Must be proficient in Excel.</li>\n<li>Strong organizational skills.</li>\n<li>Work well in a fast-paced team setting - \"no job too small\"</li>\n<li>Excellent communication skills, written and verbal.</li>\n<li>A passion or delivering great service and supporting Brands.</li>\n<li>Must be creative and have a high level of initiative.</li>\n<li>Strong interpersonal skills as well as a strong customer focus.</li>\n<li>Analyze, understand and share best practices, and champion creativity across the platform to increase sales and customer engagement</li>\n<li>MBA is a plus but not required</li>\n<li>Fashion experience, including an understanding of fashion calendars, brand behaviors and brand attributes is HUGE plus, but not required.</li>\n</ul>\n<p>&nbsp;</p>\n<h3><strong>ABOUT SPRING:</strong></h3>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience.&nbsp;Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Celine, and Marc Jacobs, just to name a few.&nbsp;Now we&rsquo;re working together to re-imagine&nbsp;mobile&nbsp;commerce.</p>\n<p>Our office is a unique hybrid of engineers and&nbsp;our brand team.&nbsp;Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking,&nbsp;guzzling cold brew and/or having late night dinners in our awesome office&nbsp;in the heart of SoHo.</p>\n<p>We provide&nbsp;our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pups, Gizmo, Pearl, and Jin.</p>\n<p>Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on an&nbsp;product that'll impact millions.&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Brand Manager", "allows_remote": false, "created_on": 1405030694, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1439476537, "application_email": "SPRING-SPRI0919@applications.recruiterbox.com", "id": "mp0esj", "is_private": true, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk084w/"}, {"description": "<p>We're looking for an iOS developer with a great sense of UX, that can both build the best iOS app out there and also help give valuable feedback on building some industry-leading world class UX.</p>\n<p>Things like good coding style, a continuous build, and tests are part of the process early on. We're very passionate about great engineering and about striking the right balance between speed, maintainability and scalability.</p>\n<p>Our current stack is Go, PostgreSQL, AngularJS and iOS and we picked them thoughtfully because they are the right tools that will help us move fast and build high quality products.</p>\n<p>&nbsp;</p>\n<h3><strong>RESPONSIBILITIES:</strong></h3>\n<ul>\n<li>Take ownership over building the best iOS app out there.</li>\n<li>Build cutting edge iOS infrastructure to deliver experiments to users, allow us to evaluate designs and features on the fly.</li>\n<li>Be quick in iterating over UX interactions and designs.</li>\n<li>Be obsessive about details, speed and app usability.</li>\n<li>Ship great code and take responsibility when things break.</li>\n</ul>\n<p>&nbsp;</p>\n<h3><strong>REQUIREMENTS:</strong></h3>\n<ul>\n<li>A degree in engineering, CS, Physics, Math - and a strong track record of interesting projects.</li>\n<li>Experience building successful iOS apps.</li>\n<li>Experience writing software for a startup or large tech company. Experience on products that served millions of users is a plus.</li>\n</ul>\n<p>&nbsp;</p>\n<h3><strong>ABOUT SPRING &amp; OUR TEAM:</strong></h3>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience.&nbsp;Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman&nbsp;and Marc Jacobs, just to name a few.&nbsp;Now we&rsquo;re working together to re-imagine&nbsp;mobile&nbsp;commerce.</p>\n<p>Our office is a unique hybrid of engineers and&nbsp;our brand team.&nbsp;Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking, guzzling cold brew and/or having late night dinners in our awesome office&nbsp;in the heart of SoHo.</p>\n<p>Our&nbsp;engineering team is&nbsp;creating a high performance infastructure, and we chose a high performing language, Go, upon which to build it.&nbsp;We're&nbsp;mostly generalists who work on all components of our stack, often switching from one product to another. We're collablorative; it's important to us that&nbsp;our dev environment be one where you can get very good at what you do very quickly, and where you have both responsibility and support.</p>\n<p>We provide&nbsp;our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team and our office pup, Gizmo.</p>\n<p>Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on an&nbsp;product that'll impact millions.&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Lead iOS Engineer", "allows_remote": false, "created_on": 1404765700, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1435855787, "application_email": "SPRING-SPRI0627@applications.recruiterbox.com", "id": "mp0e1y", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk088l/"}, {"description": "<p>Spring is looking for a&nbsp;Technical Project Manager to join our rapidly growing Platform Integrations team. This&nbsp;position&nbsp;is responsible for leading and managing ecommerce integration projects in support of onboarding integrated Brands onto Spring&rsquo;s platform. &nbsp;</p>\n<p>This position leverages your combination of technical project management or similar background with a strong business orientation to interface cross-functionally with both internal stakeholders and external groups such as Brand business and technical representatives, and their systems integrators. We work simultaneously on multiple projects, along differing timelines, so you should have strong organizational, project and time management skills, and an ability to effectively prioritize project work. Additionally, this role will be responsible for configuration&nbsp;and testing using our Magento Extension and Demandware Cartridge, and so experience with these (or other ecommerce systems) is a big plus! &nbsp;This role reports to the Director of Platform Integrations in Spring&rsquo;s NYC office.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Be a Subject Matter Expert on the features and benefits of our integrations</li>\n<li>Configure and test ecommerce integrations, escalating to Integration Engineers when necessary.&nbsp;</li>\n<li>Create and maintain positive relationships with both internal company and external Brand/systems integrator teams</li>\n<li>Schedule and lead calls and meetings with Brands, including project kickoffs and sales support presentations, among others</li>\n<li>Set up and manage integration projects using project management systems</li>\n<li>Assist with brand shop and product integrity testing pre-launch</li>\n<li>Assist with the rollout of periodic new feature releases and the project management of Brand adoption of such features</li>\n<li>Assist with the improvement of technical documentation through the identification and closing of knowledge gaps</li>\n<li>Assist with the identification and execution of process improvement initiatives</li>\n<li>Monitor status across projects and identify, escalate, and mitigate risks</li>\n<li>Maintain clear and concise project status reports and dashboards to effectively communicate implementation progress and issues to key stakeholders</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>3-5 Years technical project management experience, preferably in ecommerce or related industries</li>\n<li>Skilled in the use of project management, CRM and related systems or software, such as Asana, Basecamp, JIRA, RelateIQ, and Zendesk.</li>\n<li>Proven ability to organize, plan, and execute in a fast-paced, complex, and multi-project environment</li>\n<li>Excellent computer, presentation, communication, and time management skills</li>\n<li>Moderate understanding of computer programming and ecommerce principles, technologies and terminology</li>\n<li>Go-getting problem solver with an ability to dive into details without losing sight of the high level project scope and goals</li>\n<li>Pride in the quality of your work</li>\n<li>PMI Certification desirable</li>\n<li>Prior ecommerce project management experience desirable</li>\n<li>Start up experience desirable</li>\n</ul>\n<p><strong>About Spring</strong></p>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience. Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman and Marc Jacobs, just to name a few. Now we&rsquo;re working together to re-imagine mobile commerce.</p>\n<p>We provide our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast everyday and lunch on Tuesdays and Thursdays. Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options, and the opportunity to work with truly excellent people on a product that'll impact millions.</p>\n<p>&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Technical Project Manager", "allows_remote": false, "created_on": 1436327117, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1437483741, "application_email": "SPRING-SPRI0734@applications.recruiterbox.com", "id": "mp0hlsx", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0hxk4/"}, {"description": "<p>We are looking for thoughtful designers to join&nbsp;Spring. As Product Designer you should be able to work collaboratively within a tightly-knit team,&nbsp;solving problems and producing beautiful, usable products. We're looking for someone with a solid design background who's hungry to tackle new challenges and grow their skillset. &nbsp;You will be pulling from all your strengths as a designer, be it product design, interaction design and/or visual design.</p>\n<h3><strong>YOU:</strong></h3>\n<ul>\n<li>5+ &nbsp;years design experience, more for senior roles, mobile experience strongly preferred</li>\n<li>Desire to experiment and innovate within a team setting</li>\n<li>Ability to work collaboratively across disciplines: strategy, development and marketing.</li>\n<li>Confidence to speak your mind.</li>\n<li>Humble but confident in your abilities.</li>\n<li>Solid&nbsp;verbal communication and reasoning skills. You can enjoy,&nbsp;demoing and talking through your designs.</li>\n<li>A&nbsp;hunger to learn, grow and teach others.</li>\n<li>Not afraid to jump into code or a willingness to learn.</li>\n</ul>\n<p><strong>SKILLS:</strong></p>\n<ul>\n<li>\n<p>Standard issue design and prototyping tools, CSS.</p>\n</li>\n</ul>\n<h3><strong>ABOUT SPRING:</strong></h3>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience. Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman and Marc Jacobs, just to name a few. Now we&rsquo;re working together to re-imagine mobile commerce.</p>\n<p>Our office is a unique hybrid of engineers and our brand team. Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking, guzzling cold brew and/or having late night dinners in our awesome office in the heart of SoHo.</p>\n<p>We provide our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pup, Gizmo.</p>\n<p>Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on an product that'll impact millions.&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Product  Designer / Senior Product Designer", "allows_remote": false, "created_on": 1405030416, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1435855792, "application_email": "SPRING-SPRI0749@applications.recruiterbox.com", "id": "mp0es1", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk08ab/"}, {"description": "<p><span style=\"color: #222222; font-size: 12.8000001907349px; font-family: arial, sans-serif;\">The Senior Manager, Growth and Acquisition Marketing is responsible for the development, execution, analysis, and reporting of paid and unpaid user growth initiatives. This role encompasses running performance-driven user acquisition campaigns across mobile and web, driving an aggressive, innovative, ROI positive, cross-channel UA strategy.&nbsp;</span></p>\n<p>&nbsp;</p>\n<p>Key responsibilities:</p>\n<ul>\n<li>\n<p>Drive cross-channel customer acquisition campaigns with strict volume and ROI goals, either internally or through Spring&rsquo;s UA agencies.</p>\n</li>\n<li>\n<p>Build, manage, monitor, test and optimize campaigns to increase performance.</p>\n</li>\n<li>\n<p>Continuously explore new opportunities for user growth, including new channels, partnerships, and messaging.</p>\n</li>\n<li>\n<p>Develop viral marketing campaigns: referral program, paid influencer campaigns, etc.</p>\n</li>\n<li>\n<p>Build growth dashboards, reports and other performance resources.</p>\n</li>\n<li>\n<p>Build, lead and manage Spring&rsquo;s UA team in the long term.</p>\n</li>\n</ul>\n<p>&nbsp;</p>\n<p>Requirements:</p>\n<ul>\n<li>\n<p>3+ years of experience running mobile and desktop mobile user acquisition campaigns with a focus on ROI against LTV, preferably for a monetized mobile app or mobile-first product.</p>\n</li>\n<li>\n<p>Proven track record of exceeding goals and reporting on performance.</p>\n</li>\n<li>\n<p>Highly analytical, data-driven and obsessed with detail: you love telling stories through data; spending hours on Excel to solve a problem is the favorite part of your day. &nbsp;</p>\n</li>\n<li>\n<p>Strong MS Excel experience required. Experience with BI and analytics tools (Looker or Tableau, Google Analytics, Appsflyer, etc.) is a plus.</p>\n</li>\n<li>\n<p>Self starter: we&rsquo;re building the mobile-first e-commerce platform in the lifestyle category at Spring, and it&rsquo;ll take innovative cross-channel UA strategies to bring it to the world. We&rsquo;ll ask you to take bets and always push boundaries.</p>\n</li>\n<li>\n<p>Bachelor&rsquo;s degree desired.</p>\n</li>\n</ul>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Sr. Manager, Acquisition and Growth Marketing", "allows_remote": false, "created_on": 1436449177, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1436466801, "application_email": "SPRING-SPRI0900@applications.recruiterbox.com", "id": "mp0hlio", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0hv19/"}, {"description": "<p>Brand Service Specialists represent Spring by supporting our Brand partners, enabling brands to best utilize the Spring platform and optimize their performance. Specialists offer platform-wide support, from onboarding to performance tips to technical support, while maintaining an excellent experience to our brands. The Brand Service Specialist&nbsp;position is an amazing opportunity for dependable, creative, solutions-oriented individuals to join our exciting, fast-growing start-up.&nbsp; This person will be brands&rsquo; advocates and do whatever it takes to solve their problems.</p>\n<p>This role is central to Spring&rsquo;s ability to scale the supply side through providing exceptional brand support service while continuously improving work processes and the technical platform.&nbsp;</p>\n<p>We&rsquo;re looking for someone passionate about creative problem-solving and getting stuff done quickly and efficiently, while maintaining a solid understanding of relationship building and management.</p>\n<p><strong>KEY RESPONSIBILITIES:</strong></p>\n<ul>\n<li>Deliver best-in-class service with fast response times and clear, helpful communications</li>\n<li>Communicate with our brand partners via email and phone</li>\n<li>Troubleshoot and improve processes for brands navigating the brand portal and ecommerce platform integrations</li>\n<li>Support brands in creating, curating, scheduling and posting content</li>\n<li>Develop internal reporting and external brand communications, such as emails and newsletters, insights, tips, and FAQs</li>\n<li>Work with our Concierge, operations, engineering, and product teams to troubleshoot technical problems, improve internal processes, and drive the brand and customer experience</li>\n<li>Proactively&nbsp;identify and execute on opportunities for enhancing/improving both the brand and the consumer experience</li>\n<li>Report all product and service-related trends to management for quick resolution</li>\n<li>Brainstorm new and exciting ways to delight our brands and make your ideas a reality</li>\n</ul>\n<p><strong>BASIC REQUIREMENTS:</strong></p>\n<ul>\n<li>Four-year college degree</li>\n<li>Exceptional oral and written communication skills with ability to convey information clearly and effectively</li>\n<li>Demonstrated problem-solving ability</li>\n<li>Accurate data entry and typing skills</li>\n<li>Strong organizational skills.</li>\n<li>Work well in a fast-paced team setting - \"no job too small\"</li>\n<li>Must be creative, and have a high level of initiative and outstanding work ethic</li>\n</ul>\n<p><strong>PREFERRED REQUIREMENTS:</strong></p>\n<ul>\n<li>Prior experience using Zendesk customer service platform</li>\n<li>Prior experience with or interest in learning SQL</li>\n<li>Prior experience with or interest in learning MailChimp</li>\n<li>Advanced proficiency with Excel</li>\n<li>Minimum 1 year providing exceptional customer or account service, preferably at a eCommerce, retail, or mobile business</li>\n</ul>\n<div>\n<h3 style=\"color: #333333; font-family: proxima-nova, helvetica, 'Droid Sans', arial, sans-serif, Calibri, Verdana;\"><span style=\"font-size: 12px;\"><strong>ABOUT SPRING:</strong></span></h3>\n<p style=\"color: #333333; font-family: proxima-nova, helvetica, 'Droid Sans', arial, sans-serif, Calibri, Verdana;\"><span style=\"font-size: 12px;\">Spring was founded with one simple vision: to create the best mobile shopping experience.&nbsp;Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman&nbsp;and Marc Jacobs, just to name a few.&nbsp;Now we&rsquo;re working together to re-imagine&nbsp;mobile&nbsp;commerce.</span></p>\n<p style=\"color: #333333; font-family: proxima-nova, helvetica, 'Droid Sans', arial, sans-serif, Calibri, Verdana;\"><span style=\"font-size: 12px;\">Our office is a unique hybrid of engineers and&nbsp;our brand team.&nbsp;Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking,&nbsp;guzzling cold brew and/or having late night dinners in our awesome office&nbsp;in the heart of SoHo.</span></p>\n<p style=\"color: #333333; font-family: proxima-nova, helvetica, 'Droid Sans', arial, sans-serif, Calibri, Verdana;\"><span style=\"font-size: 12px;\">We provide&nbsp;our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pup, Gizmo.</span></p>\n<p style=\"color: #333333; font-family: proxima-nova, helvetica, 'Droid Sans', arial, sans-serif, Calibri, Verdana;\"><span style=\"font-size: 12px;\">Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on an&nbsp;product that'll impact millions.&nbsp;</span></p>\n<p><span style=\"font-size: 12px;\">&nbsp;</span></p>\n</div>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Brand Service Specialist", "allows_remote": false, "created_on": 1420323917, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1438985923, "application_email": "SPRING-SPRI0152@applications.recruiterbox.com", "id": "mp0hmni", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0ero/"}, {"description": "<p>We're looking for a talented and technically well-rounded person who loves to tackle complex problems, both first-hand and by inspiring a community of like-minded developers.</p>\n<p>Spring delivers a high quality marketplace platform that helps brands curate a compelling assortment of products to be presented and ordered by customers in Spring&rsquo;s industry-leading mobile apps. To help accomplish this, Spring has developed ecommerce platform integrations with Shopify, Demandware, and Magento, as well as a commerce API specification to serve as the basis for rapidly expanding these integrations.</p>\n<p>This role is central to Spring&rsquo;s ability to scale the supply side through owning engineering for Spring&rsquo;s current integration products and managing open source development initiatives to create more.</p>\n<p>We&rsquo;re looking for someone passionate about great engineering and getting stuff done, while maintaining a solid understanding of dependencies, scale, and the tradeoffs that come with each choice they make. Things like good coding style, a continuous build, and tests are part of the process early on. We're very committed to striking the right balance between speed, maintainability, and scalability.</p>\n<p class=\"p1\">Our core platform stack is Go, PostgreSQL, AngularJS, and&nbsp;iOS, and we picked them thoughtfully because they are the right tools that will help us move fast and build high quality products.&nbsp;</p>\n<h3 class=\"p2\"><strong>RESPONSIBILITIES:<br /></strong></h3>\n<ul>\n<li>\n<p>Own engineering for the integration products, shipping great code and taking responsibility when things break</p>\n</li>\n<li>\n<p>Team up with the head of Platform Integrations to identify, develop, test, and deploy key enhancements to the integration products</p>\n</li>\n<li>\n<p>Co-lead the setup and management of an open source, community-based approach to growing the integration product portfolio</p>\n</li>\n<li>Serve as an integration products subject matter expert with brands&rsquo; engineering teams</li>\n</ul>\n<h3 class=\"p2\"><strong>REQUIREMENTS:<br /></strong></h3>\n<ul>\n<li>\n<p>A degree in engineering, CS, Math, or related discipline, with a strong track record of success on interesting projects</p>\n</li>\n<li>\n<p>Experience building and supporting ecommerce storefronts and/or platform extensions, preferably on Demandware and/or Magento</p>\n</li>\n<li>\n<p>Comfortable switching languages and learning new ones</p>\n</li>\n<li>\n<p>Ability to go from writing code to sysadmin at a moment's notice to get a product shipped</p>\n</li>\n<li>\n<p>Experience writing software for a startup or large tech company, preferably on products that served millions of users</p>\n</li>\n<li>Excellent verbal and written communication skills &ndash; this role is brand-facing</li>\n</ul>\n<h3 class=\"p2\"><strong>ABOUT SPRING &amp; OUR TEAM:</strong></h3>\n<p class=\"p1\">Spring was founded with one simple vision: to create the best mobile shopping experience.&nbsp;Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman&nbsp;and Marc Jacobs, just to name a few.&nbsp;Now we&rsquo;re working together to re-imagine&nbsp;mobile&nbsp;commerce.</p>\n<p class=\"p1\">Our office is a unique hybrid of engineers and&nbsp;our brand team.&nbsp;Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking,&nbsp;guzzling cold brew and/or having late night dinners in our awesome office&nbsp;in the heart of SoHo.</p>\n<p class=\"p1\">Our&nbsp;engineering team, more specifically, is&nbsp;creating a high performance infastructure, and we chose a high performing language, Go, upon which to build it.&nbsp;We're&nbsp;mostly generalists who work on all components of our stack, often switching from one product to another. We're collaborative; it's important to us that&nbsp;our dev environment be one where you can get very good at what you do very quickly, and where you have both responsibility and support.</p>\n<p class=\"p1\">We provide&nbsp;our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pup, Gizmo.</p>\n<p class=\"p1\">Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on a product that'll impact millions.</p>", "tags": [], "position_type": "full_time", "is_archived": true, "title": "TBD Integrations", "allows_remote": false, "created_on": 1421361111, "location": {"city": "New York", "state": "NY", "country": "United States"}, "team": "", "modified_on": 1434983357, "application_email": "SPRING-SPRI0488@applications.recruiterbox.com", "id": "mp0hfe4", "is_private": true, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk05iz/"}, {"description": "<blockquote style=\"color: #222222; font-size: 12.8000001907349px; font-family: arial, sans-serif;\">\n<div dir=\"ltr\">\n<div class=\"gmail_default\" style=\"font-size: small; font-family: arial, helvetica, sans-serif;\"><span style=\"font-size: 15px; font-family: Arial;\">Spring is a fast-growing mobile commerce start-up in the heart of Soho and we&rsquo;re looking for someone awesome to join our marketing team full time. </span><span style=\"color: #212f40; font-size: 15px; font-family: Arial;\">You are great with a camera, a wizard with photoshop, creative, genuinely interested and well-versed in fashion, organized, enjoy merchandising products, and are excited about the ecommerce / tech + fashion space.</span></div>\n<div class=\"gmail_default\" style=\"font-size: small; font-family: arial, helvetica, sans-serif;\">&nbsp;</div>\n<div class=\"gmail_default\" style=\"font-size: small; font-family: arial, helvetica, sans-serif;\"><span style=\"color: #212f40; font-size: 15px; font-family: Arial;\">Responsibilities will include working closely with our marketing team to concept and product assets for various marketing and digital channels. You will play a large role in building our visual language with product and content + and our social presence by managing the day-to-day content and execution across Spring&rsquo;s digital + social channels.</span></div>\n<div class=\"gmail_default\" style=\"font-size: small; font-family: arial, helvetica, sans-serif;\">&nbsp;</div>\n<div class=\"gmail_default\" style=\"font-size: small; font-family: arial, helvetica, sans-serif;\"><span style=\"color: #212f40; font-size: 15px; font-family: Arial;\">You must be organized, creative, energetic, passionate and a roll-up-your-sleeves / ready to dive in / startup type. </span></div>\n<div class=\"gmail_default\" style=\"font-size: small; font-family: arial, helvetica, sans-serif;\"><br /><span style=\"color: #212f40; font-size: 15px; font-family: Arial;\">Key Responsibilities:</span>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\">Manage the day-to-day content and execution across Spring&rsquo;s digital and social channels (Facebook, Google+, Twitter, Instagram, Pinterest, Tumblr, etc)</li>\n</ul>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\">Concept and produce assets for various marketing and digital channels</li>\n</ul>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\">Align and support the marketing and editorial calendars with Spring&rsquo;s social activity</li>\n</ul>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\">Identify opportunities to engage with brands, customers, influencers in online conversations</li>\n</ul>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\">Identify KPI&rsquo;s for ongoing initiatives&mdash;analyze findings based on benchmark goals and apply learnings for future campaigns</li>\n</ul>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\"><span style=\"color: #212f40;\">Product/merchandise styling (general knowledge of fashion brands)</span></li>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\">Email Design (Photoshop, Dreamweaver) and coding (HTML, CSS)</li>\n</ul>\n<br /><span style=\"color: #212f40; font-size: 15px; font-family: Arial;\">Desired Skills:</span><br />\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\"><span style=\"color: #212f40;\">Design background with strong photography and photo-editing skills (Photoshop, Illustrator and InDesign, as well as phone app editing tools like Afterlight and Snapseed)</span></li>\n</ul>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\"><span style=\"color: #212f40;\">Think creatively while working on tight deadlines</span></li>\n</ul>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\"><span style=\"color: #212f40;\">Highly organized to execute production deliverables</span></li>\n</ul>\n<ul>\n<li dir=\"ltr\" style=\"font-size: 15px; font-family: Arial;\">Coding of HTML, CSS is a plus</li>\n</ul>\n</div>\n<div class=\"yj6qo ajU\">\n<div id=\":29w\" class=\"ajR\" style=\"background-color: #f1f1f1;\" tabindex=\"0\" data-tooltip=\"Show trimmed content\"><img class=\"ajT\" src=\"https://ssl.gstatic.com/ui/v1/icons/mail/images/cleardot.gif\" alt=\"\" /></div>\n</div>\n</div>\n</blockquote>", "tags": [], "position_type": "full_time", "is_archived": true, "title": "Social Media/Content Production Specialist", "allows_remote": false, "created_on": 1424636492, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1433950886, "application_email": "SPRING-SPRI0037@applications.recruiterbox.com", "id": "mp0hqss", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0btq/"}, {"description": "<h3><strong>Opportunity</strong></h3>\n<p>Spring was founded with one simple vision: to create the best (and most beautiful) mobile shopping experience. Partnered with hundreds of retailers, Spring's first consumer app re-imagines mobile commerce - and recently launched to rave reviews. The Head of Partnerships will lead Spring&rsquo;s efforts to partner with various partners across industries to drive brand awareness and acquisition. They will work to create a community of brand partners for which Spring can market to, from the travel, lodging, entertainment, sports, and technology industries.</p>\n<p>The Head of Partnerships will be key to leading the evolution of Spring's marketing and brand messaging to lead their expansion in the marketplace. With a strong sense of brand and storytelling, the Head of Partnerships will oversee and drive Spring's brand and translate positioning to actionable growth. They will lead both business and brand strategies, and propel a creative platform that communicates a compelling value proposition for current and prospective customers. Spring is a spirited and collaborative environment and the Head of Partnerships will work closely with the CEO and a distinguished team of industry leaders (from Google, FourSquare, DVF, Bergdorf and Marc Jacobs) to shape the future of commerce and build a product users want to open everyday.</p>\n<h3>&nbsp;</h3>\n<h3><strong>Profile</strong></h3>\n<p>Curious. Collaborative. Experimental. Gutsy. Agile. Hands-on. Cool. Optimistic. Smarts. Role</p>\n<p>Spring is seeking a true Marketing Leader - with a demonstrated track record for defining and managing a comprehensive brand expression. Spring will look to the Head of Partnerships to influence and inspire the organization with passion and creativity as it expands to partner with other industry leading brands. The Head of Partnerships will combine strategic and conceptual ability and bring an imaginative, creative vision and point of view, balanced with a motivational leadership style. They will act as the overall champion and conscience for the Spring brand as it partners with other brands.</p>\n<p>Responsibilities include building short and long term strategies, developing integrated plans, and translating brand messages into powerful consumer brand experiences and stories. They will be chiefly responsible for sourcing, negotiating, and executing partnerships with brands other than Spring. They will be a thought innovator who can push the team to be the best they can be!</p>\n<p>&nbsp;</p>\n<h3><strong>Organizational Structure</strong></h3>\n<p>Reports to: CEO, Alan Tisch</p>\n<p>&nbsp;</p>\n<h3><strong>More About Spring</strong></h3>\n<p>Key Leadership</p>\n<p>Alan Tisch - CEO / Founder (previous FAB) www.linkedin.com/in/alantisch\u2028Octavian Costache - CTO Founder (previous Google) www.linkedin.com/in/okviv\u2028David Tisch - Founder (TechStars, Box Fund) www.linkedin.com/in/davetisch\u2028Katherine Prime - VP Operations (Former Quidsi) www.linkedin.com/pub/katherine-prime/0/897/976\u2028April Uchitel Chief Brand Officer (Former DVF) www.linkedin.com/pub/april-uchitel/14/6b4/2b5\u2028Beth Ferreira - Operations Head / Genius - (Former COO Etsy, COO FAB) www.linkedin.com/in/bethmferreira Leland Rechis - Advisor www.linkedin.com/pub/leland-rechis/0/6/a63</p>\n<h3><strong>Press</strong></h3>\n<p>Fast Company - Innovation Agents http://bit.ly/10MXVvz</p>\n<p>Fast Company http://www.fastcompany.com/3034362/spring-the-app-that-promises-to-make-mobile-shopping-fun</p>\n<p>Huffington Post http://www.huffingtonpost.com/fueled/the-spring-app-did-the-fa_b_5851578.html</p>\n<p>Forbes http://onforb.es/YdIjk4</p>\n<p>CNN http://www.cnn.com/interactive/2014/10/tech/cnn10-startups/index.html</p>\n<p>TechCrunch http://techcrunch.com/2014/08/14/spring-david-tischs-latest-venture-is-instagram-for-shopping/</p>\n<p>Vogue http://www.vogue.com/972293/spring-app-changes-mobile-shopping/</p>\n<p>Fortune http://fortune.com/2014/07/09/david-alan-tisch-raise-7-million-spring-startup/</p>\n<p>Crunchbase http://www.crunchbase.com/organization/jello-lab</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>", "tags": [], "position_type": null, "is_archived": true, "title": "Head of Partnerships", "allows_remote": null, "created_on": 1418336374, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1418756607, "application_email": "SPRING-SPRI0571@applications.recruiterbox.com", "id": "mp0h647", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0yl9/"}, {"description": "<h3><strong>About Spring &amp; Our Engineering Team</strong></h3>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience. Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google, Foursquare and Medium. Now we&rsquo;re working together to re-imagine mobile commerce.</p>\n<p>Our engineering team, more specifically, is creating a high performance infrastructure, and we chose a high performing language, Go, upon which to build it. We&rsquo;re mostly generalists who work on all components of our stack, often switching from one product to another. We&rsquo;re collaborative; it&rsquo;s important to us that our dev environment be one where you can get very good at what you do very quickly, and where you have both responsibility and support.</p>\n<p>Things like good coding style, a continuous build, tests are part of the process early on. We're very passionate about great engineering and about striking the right balance between speed, maintainability and scalability.</p>\n<p>Our current stack is Go, PostgreSQL, AngularJS and iOS and we picked them thoughtfully because they are the right tools that will help us move fast and build high quality products.</p>\n<p>&nbsp;</p>\n<h3><strong>What Will our Interns Do?</strong></h3>\n<p>We're looking for interns who love to get stuff done, but also understand code quality, large scale, and the tradeoffs that come with each choice they make. As a Spring Summer engineering intern, you will be given a real project to work on that will ship as part of our consumer iOS and/or brand facing app. You will get individual mentorship from members of our engineering team, seasoned programmers with a lot of experience at tech companies both small and large.</p>\n<p>At other companies, your internship will be strongly patterned after the interns that came 1 or even 10 years before you. At Spring, you&rsquo;ll be a member of our very first intern class, so you&rsquo;ll not only get to ship code, you&rsquo;ll be creating your experience organically from day one. You&rsquo;ll be given a vision for the future of our app, and the responsibility to own your part in it&rsquo;s creation.</p>\n<p>We&rsquo;re a small company, and we&rsquo;re very transparent, so you&rsquo;ll see everything that goes into building Spring: code, marketing, sales, design, customer support, brand curation, etc., the kind of stuff you would never learn somewhere bigger or more corporate. You&rsquo;ll also get one on one time with our leadership, who make a point of making sure each employee&rsquo;s work is seen.</p>\n<p>And if that's not enough,&nbsp;we&rsquo;re located in New York, so when you need a break from coding, you can rent a CitiBike and explore, take in a world class show or concert, or go have a bowl of ramen (or whatever your culinary pleasure is) at one of the amazing restaurants all over the city.</p>\n<p>&nbsp;</p>\n<h3><strong>Requirements</strong></h3>\n<ul>\n<li>\n<p>The internship will last between 10 - 12 weeks, so you must be available for that amount of time this summer with flexibility</p>\n</li>\n<li>\n<p>Must live or relocate to NY for the duration of the internship</p>\n</li>\n<li>\n<p>Preference will be given to students between their Junior and Senior years&nbsp;at a&nbsp;4 year academic institution or enrolled in a Masters or PHD program. If you're a brainiac right out of highschool, that's great too! Just be able to show us your work and tell us why you're a good fit.</p>\n</li>\n<li>\n<p>Comfort with switching languages and learning new ones. Go is a young language and we don't expect you to be proficient in it, but you will have to pick it up.</p>\n</li>\n<li>\n<p>A Computer Science major</p>\n</li>\n<li>\n<p>Great communication skills</p>\n</li>\n</ul>\n<p><br /><br /></p>\n<h3><strong>Benefits</strong></h3>\n<ul>\n<li>\n<p>Competitive salary ($4,000/month)</p>\n</li>\n<li>\n<p>$1,500 monthly housing stipend</p>\n</li>\n<li>\n<p>Free soft drinks, coffee and snacks everyday</p>\n</li>\n<li>\n<p>Free lunches twice a week in office and free breakfast in office every Monday, Wednesday and Friday</p>\n</li>\n<li>\n<p>One on one mentorship with one of our awesome engineers</p>\n</li>\n<li>\n<p>Monthly team events around New York</p>\n</li>\n</ul>\n<p><br /><br /></p>\n<h3><strong>About Spring</strong></h3>\n<p>Our office is a unique hybrid of engineers and our brand team. Though our backgrounds in development and fashion may seem an odd pairing, we&rsquo;re actually a tight knit bunch! You&rsquo;ll find us cranking, guzzling cold brew and/or having late night dinners in our awesome office in the heart of SoHo.</p>\n<p>We provide our employees with a happy, productive workplace, and we&rsquo;re constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pup, Gizmo.</p>\n<p>&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": true, "title": "Spring Engineering Intern (Summer 2015)", "allows_remote": false, "created_on": 1412870167, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1430168916, "application_email": "SPRING-SPRI0781@applications.recruiterbox.com", "id": "mp0bil", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0ayn/"}, {"description": "<p>Spring is building the best mobile shopping experience. Since its August 2014 launch, Spring has seen tremendous growth and traction, has been embraced by the fashion industry, and was named one of Apple&rsquo;s Best of 2014 apps. Currently at 50 employees, scaling the team is key to achieving our goals.</p>\n<p>We&rsquo;re looking for an exceptional recruiting director to own strategy, develop recruiting processes, and make hires to meet our ambitious growth goals. While this role will own recruiting across the team, Spring is fundamentally a technology company, and the emphasis of this role will be on building the engineering team.</p>\n<p><strong>You will:</strong></p>\n<ul>\n<li>\n<p>Recruit and hire engineers to join one of the strongest and most exciting technical teams in NYC</p>\n</li>\n<li>\n<p>Explore creative ways to attract and network with the best talent in our markets</p>\n</li>\n<li>\n<p>Manage our overall recruiting function, building an efficient hiring machine to help scale the business</p>\n</li>\n<li>\n<p>Assess the company&rsquo;s culture and capabilities and help to articulate, promote and leverage our employment brand &nbsp;</p>\n</li>\n<li>\n<p>Oversee a recruiting and interview process that will filter for top talent, make productive use of interviewers&rsquo; time and deliver an irresistible candidate experience</p>\n</li>\n<li>\n<p>Partner with executives and hiring managers to create and manage hiring plans, and determine and deploy the necessary resources to meet hiring goals</p>\n</li>\n<li>\n<p>Manage all sourcing channels, including job postings, agency partnerships, direct sourcing, employee referrals, events and networking</p>\n</li>\n<li>\n<p>Determine the success metrics and workflow of recruiting to continually measure, experiment and manage to your hiring goals</p>\n</li>\n<li>\n<p>Evaluate and implement an ATS to manage hiring</p>\n</li>\n<li>\n<p>Leverage your network to bring in key senior members of the team and to build the company&rsquo;s brand presence.</p>\n</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>You should have:</strong></p>\n<ul>\n<li>\n<p>5+ years of experience in technical recruitment, ideally at a tech start-up or similar environment with high expectations for talent</p>\n</li>\n<li>\n<p>Agility and enthusiasm for recruiting across departments and levels</p>\n</li>\n<li>\n<p>Experience building and managing hiring process at high growth company</p>\n</li>\n<li>\n<p>Hiring managers who loved working with you - you&rsquo;ve brought positive change to a process and team, and they&rsquo;re glad you did.</p>\n</li>\n<li>\n<p>Familiarity with all recruiting models and processes, as well as start-up environments</p>\n</li>\n<li>\n<p>Excellent presentation, communication and negotiating skills</p>\n</li>\n<li>\n<p>Ability to organize resources and drive results</p>\n</li>\n<li>\n<p>An innovative streak and analytical skills</p>\n</li>\n<li>\n<p>Business maturity mixed with humility and a sense of humor</p>\n</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>About Spring</strong></p>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience. Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman and Marc Jacobs, just to name a few. Now we&rsquo;re working together to re-imagine mobile commerce.</p>\n<p>We provide our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our office pup, Gizmo.</p>\n<p>Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on a product that'll impact millions.</p>\n<p>&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": true, "title": "Director of Recruiting", "allows_remote": false, "created_on": 1429643850, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1434380334, "application_email": "SPRING-SPRI0309@applications.recruiterbox.com", "id": "mp0hpop", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk0h1h2/"}, {"description": "<p>We are looking for a Product Manager to lead the ongoing product development of our mobile app presence, from feature conception to launch. &nbsp;You will be working with our founders, design and engineering teams to plan our product roadmap, set product strategy and execute on the delivery of an award winning consumer app. &nbsp;</p>\n<p>You will be pulling from all your strengths in Product Management and applying them to a fast-paced startup environment. &nbsp;We expect you to: Have a keen attention to detail; thoughtfully communicate product goals and requirements; and seamlessly work with talented engineers, designers and operations staff. &nbsp;</p>\n<h3>YOU:</h3>\n<ul>\n<li>\n<p>5+ years Product experience</p>\n</li>\n<li>\n<p>Strong understanding of major mobile platforms</p>\n</li>\n<li>\n<p>Knowledge across multiple functional areas including design and engineering (We prefer that you have a background as a contributing designer or engineer)</p>\n</li>\n</ul>\n<ul>\n<li>\n<p>A desire to set the pace of a team, identify and clear any ambiguity they might face.</p>\n</li>\n<li>\n<p>Natural ability to work collaboratively across all disciplines (design, development, strategy, marketing)</p>\n</li>\n<li>\n<p>Confidence to speak your mind</p>\n</li>\n<li>\n<p>Humble but confident in your abilities</p>\n</li>\n<li>\n<p>Excellent &nbsp;verbal communication, organizational and reasoning skills (the ability to set a product process and have teams buy into it)</p>\n</li>\n</ul>\n<p>&nbsp;</p>\n<h3>ABOUT SPRING:</h3>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience. Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman and Marc Jacobs, just to name a few. Now we&rsquo;re working together to re-imagine mobile commerce.</p>\n<p>Our office is a unique hybrid of engineers and our brand team. Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking, guzzling cold brew and/or having late night dinners in our awesome office in the heart of SoHo.</p>\n<p>We provide our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our two office pups, Gizmo &amp; Fred.</p>\n<p>Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on an product that'll impact millions.</p>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Product Manager", "allows_remote": false, "created_on": 1421358416, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1436191898, "application_email": "SPRING-SPRI0898@applications.recruiterbox.com", "id": "mp0hfed", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk05is/"}, {"description": "<p>This Customer Care representative position offers an amazing opportunity for experienced, dependable, empathetic, and creative professionals to join our exciting, fast-growing start-up. This person will be our customers' advocates and do whatever it takes to solve problems and delight customers every day.</p>\n<p>Our customers are at the heart of everything we do, and our customer care team will be the ambassadors of our brand. As we grow, you will be the voice of the customer, helping to define our product and customer service experience and constantly improving how customers interact with us.</p>\n<p>You will offer customer support by email and phone, working closely with our brand partners and internal teams. If you get excited about delivering outstanding, memorable experiences, getting creative about solving problems, and delighting customers at every turn, this is the role for you.</p>\n<p>&nbsp;</p>\n<h3><strong>YOU:</strong></h3>\n<ul>\n<li>Love helping people and going above-and-beyond to make someone's day</li>\n<li>Are positive, enthusiastic, fun, and optimistic, tackling every challenge with a smile and can-do attitude</li>\n<li>Are an excellent, creative problem solver and multi-tasker, balancing many projects at once without missing a beat</li>\n<li>Get excited about change and fast-paced environments. You are flexible and able to go with the flow</li>\n<li>Are proactive. You don't wait to be told what to do; when you see something that can be better, you have great judgment and can fix it with minimal information and little oversight</li>\n<li>Are thoughtful and empathetic, able to connect with our customers as an ally and a friend, building relationships with every interaction</li>\n<li>Learn quickly. Your curiosity and passion mean that you can get up to speed and have an impact from day one</li>\n</ul>\n<p>&nbsp;</p>\n<h3><strong>YOU WILL BE:</strong></h3>\n<ul>\n<li>Communicating with our customers via email, phone, and social media</li>\n<li>Interacting with brand partners to help answer customer questions</li>\n<li>Developing relationships with customers to keep them coming back</li>\n<li>Delivering best-in-class service with fast response times and clear, helpful communications</li>\n<li>Working with our Brand Management, operations, and product teams to troubleshoot problems, improve internal processes, and drive the customer experience</li>\n<li>Reporting all product and service-related trends to management for quick resolution</li>\n<li>Brainstorming new and exciting ways to delight our customers&acirc;&euro;&brvbar; and making your ideas a reality!</li>\n</ul>\n<p>&nbsp;</p>\n<h3><strong>BASIC REQUIREMENTS:</strong></h3>\n<ul>\n<li>Exceptional oral and written communication skills with ability to convey information clearly and effectively</li>\n<li>Accurate data entry and typing skills</li>\n<li>Outstanding work ethic</li>\n</ul>\n<h3><br /><strong>PREFERRED REQUIREMENTS:</strong></h3>\n<ul>\n<li>Four-year college degree</li>\n<li>Computer savvy</li>\n<li>Prior experience using Zendesk customer service platform</li>\n<li>Minimum 1 year providing exceptional customer service, preferably at a eCommerce, retail, or mobile business</li>\n</ul>\n<h3>&nbsp;</h3>\n<h3><strong>ABOUT SPRING:</strong></h3>\n<p>Spring was founded with one simple vision: to create the best mobile shopping experience.&nbsp;Members of our team have helped change the world through their previous work building products used and loved by hundreds of millions of people at tech companies like Google and Medium and brands such as DVF, Bergdorf Goodman&nbsp;and Marc Jacobs, just to name a few.&nbsp;Now we&rsquo;re working together to re-imagine&nbsp;mobile&nbsp;commerce.</p>\n<p>Our office is a unique hybrid of engineers and&nbsp;our brand team.&nbsp;Though our backgrounds in development and fashion may seem an odd pairing, we're actually a tight knit bunch! You'll find us cranking,&nbsp;guzzling cold brew and/or having late night dinners in our awesome office&nbsp;in the heart of SoHo.</p>\n<p>We provide&nbsp;our employees with a happy, productive workplace, and we're constantly improving! We keep a stocked fridge, bring in breakfast 3 times a week, lunch on Tuesdays and Thursdays. We love karaoke, our kickball team, and our&nbsp;two office pups, Gizmo &amp; Fred.</p>\n<p>Our employees enjoy full benefits, unlimited vacation time, a competitive salary, stock options and the opportunity to work with truly excellent people on an&nbsp;product that'll impact millions.&nbsp;</p>", "tags": [], "position_type": "full_time", "is_archived": false, "title": "Customer Care Representative", "allows_remote": false, "created_on": 1405031159, "location": {"city": "New York", "state": "New York", "country": "United States"}, "team": "", "modified_on": 1438027425, "application_email": "SPRING-SPRI0752@applications.recruiterbox.com", "id": "mp0es3", "is_private": false, "hosted_url": "http://SPRING.recruiterbox.com/jobs/fk084h/"}], "meta": {"total": 40, "limit": 20, "offset": 0}}